Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/health_service_agencies/general_medical_services_payments_board.html.txt.tmx
Source language: en
Languages: ga

source: Primary Care Reimbursement Service
ga: An tSeirbhís Aisíoctha do Chúram Príomhúil

source: The Primary Care Reimbursement Service administers payments to doctors, pharmacists, dentists and opticians who provide services under the Primary Care Reimbursement Service (PCRS) scheme
ga: Is í an tSeirbhís Aisíocaíochta do Chúram Príomhúil a riarann íocaíochtaí le lianna, cógaiseoirí, fiaclóirí agus radharceolaithe a sholáthraíonn seirbhísí faoi scéim na Seirbhíse Aisíocaíochta do Chúram Príomhúil (PCRS)

source: All aspects of the management and operation of the PCRS are operated through the Health Service Executive (HSE)
ga: Is í Feidhmeannacht na Seirbhíse Sláinte a riarann gach gné de bhainistiú agus d’fheidhmiú na Scéimeanna Aisíoctha do Chúram Príomhúil anois

source: This scheme was previously called the General Medical Services Payments Board, usually referred to as the GMS
ga: Tugadh an Bord Íocaíochtaí na Seirbhísí Leighis Ginearálta, dá ngairfear an SLG, mar ainm ar an scéim seo roimhe sin

source: The PCRS scheme includes medical card services provided by doctors and pharmacists, prescribed drugs and medicines services provided by community pharmacists and dental services and opthalmic services provided to medical card holders
ga: Áirítear leis an scéim PCRS seirbhísí chárta leighis a fhónann lianna agus cógaiseoirí, seirbhísí drugaí agus cógais ar oideas a thugann cógaiseoirí pobail agus seirbhísí fiaclóireachta agus seirbhísí oftalmacha a thugtar do shealbhóirí cárta leighis

source: Doctors, pharmacists, dentists and opticians have contracts with the Health Service Executive (HSE) to provide these services and the PCRS makes the payments on behalf of the HSE
ga: Tá conarthaí ag lianna, cógaiseoirí, fiaclóirí agus radharceolaithe le Feidhmeannacht na Seirbhíse Sláinte (FSS) chun na seirbhísí úd a fhónamh agus is í an PCRS a dhéanann na híocaíochtaí ar son na FSS

source: The level of payments and other conditions of service are negotiated by the Department of Health and the relevant professional bodies
ga: Déanann an Roinn Sláinte idirbheartaíocht leis na comhlachtaí gairmiúla ábhartha faoi mhéid na n-íocaíochtaí agus faoi choinníollacha seirbhíse eile

source: What is the PCRS responsible for?
ga: Céard as a bhfuil an tSeirbhís Aisíoctha do Chúram Príomhúil (SACP) freagrach?

source: The PCRS is responsible for:
ga: Tá an tSeirbhís Aisíoctha do Chúram Príomhúil freagrach go bunúsach as:

source: • Calculating payments to be made for the services provided
ga: • Costas na n-íocaíochtaí a áireamh i gcás na seirbhísí a cuireadh ar fáil

source: • Making payments for services provided
ga: • An t-airgead sin a íoc

source: • Verifying the accuracy and reasonableness of claims made by services
ga: • Déanamh cinnte go bhfuil na héilimh ar íocaíocht as na seirbhísí seo cruinn réasúnta

source: • Compiling statistics and other information in relation to services
ga: • Staitisticí agus faisnéis eile a chur le chéile faoi na seirbhísí seo

source: The PCRS issues an Annual Report that shows the number of people covered by medical cards, the costs of the services and related information
ga: Cuireann an tSeirbhís tuarascáil bhliantúil ar fáil a léiríonn líon na ndaoine a bhfuil cártaí leighis acu, costas na seirbhísí agus faisnéis eile bhainteach

source: The PCRS has a Complaints Tribunal that investigates complaints by the Health Service Executive (HSE) against individual doctors, pharmacists or dentists and complaints and appeals by the health professionals against HSE decisions affecting them
ga: Tá Binse Gearán ag an tSeirbhís a iniúchann na gearáin a dhéanann Feidhmeannacht na Seirbhíse Sláinte (FSS) in aghaidh dochtúirí, cógaiseoirí agus fiaclóirí éagsúla, agus gearáin agus achomhairc a dhéanann gairmithe sláinte in aghaidh cinntí na FSS a théann i bhfeidhm orthu
